src/ut10_old/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/CommonModules/ТБК_ОбменУТНовая/Ext/Module.bsl
Функция ЗарегестрироватьПоТаблицеТовары(тчТовары) ЭКСПОРТ
	
	мНомен = тчТовары.ВыгрузитьКолонку("Номенклатура");
	мХарактеристики = тчТовары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"); 
	мЕдИзм = тчТовары.ВыгрузитьКолонку("ЕдиницаИзмерения");
	
	
	мУзлы = Новый Массив;
	
	мУзлы = ПолучитьВсеУзлыРозницы();
	
	
	Для Каждого эл из мНомен Цикл		
		Если ЗначениеЗаполнено(эл) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(мУзлы,эл);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого эл из мХарактеристики Цикл
		Если ЗначениеЗаполнено(эл) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(мУзлы,эл);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого эл из мЕдИзм Цикл
		Если ЗначениеЗаполнено(эл) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(мУзлы,эл);
		КонецЕсли;
	КонецЦикла;

	
	ЗарегестрироватьШтрихКодыНажатиеПоМассив(мНомен);
	
	Сообщить("Обработано для регистрации "+тчТовары.Количество()+" строк документа");
КонецФУнкции


Функция ПолучитьВсеУзлыРозницы()
	узлы = ПланыОбмена.Полный.Выбрать();
	
	мрезультат = новый Массив;
	
	
	Пока узлы.Следующий() Цикл
		Если ЗначениеЗаполнено(узлы.НомерОтправленного) Тогда
			мрезультат.Добавить(узлы.Ссылка);
		КонецЕсли;
	Конеццикла;
	
	Возврат мрезультат;

КонецФункции

Функция ЗарегестрироватьШтрихКодыНажатиеПоМассив(мНомен, регестрироватьЕдизм = ложь)
	мУзлы = Новый Массив;
	
	мУзлы = ПолучитьВсеУзлыРозницы();
	
	Для Каждого эл из мНомен Цикл
		
		Если НЕ ЗначениеЗаполнено(эл.Наименование) Тогда
			продолжить;
		КонецЕсли;
		
		
		нз = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		нз.Отбор.Владелец.Установить(эл, истина);
		нз.Прочитать();
		Для Каждого запись из нз Цикл
			
			Если НЕ ЗначениеЗаполнено(запись.Штрихкод) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(запись.ЕдиницаИзмерения.Наименование) Тогда
				Продолжить;
			КонецЕсли;
			//ПланыОбмена.ЗарегистрироватьИзменения(мУзлы,запись);
			
			нзРег = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
			нзРег.Отбор.Штрихкод.Установить(запись.Штрихкод, истина);
			нзРег.Отбор.Владелец.Установить(запись.Владелец, истина);
			нзРег.Отбор.ТипШтрихкода.Установить(запись.ТипШтрихкода, истина);
			нзРег.Отбор.ЕдиницаИзмерения.Установить(запись.ЕдиницаИзмерения, истина);
			нзРег.Отбор.ХарактеристикаНоменклатуры.Установить(запись.ХарактеристикаНоменклатуры, истина);
			нзРег.Отбор.СерияНоменклатуры.Установить(запись.СерияНоменклатуры, истина);
			нзРег.Отбор.Качество.Установить(запись.Качество, истина);
			нзРег.Отбор.УдалитьКод.Установить(запись.УдалитьКод, истина);
			
			нзРег.Отбор.Дата.Установить(запись.Дата, истина);
			
			нзРег.Прочитать();
						
			Если нзРег.Количество() >0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(мУзлы,нзРег);
			КонецЕсли;
			Если регестрироватьЕдизм Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(мУзлы,запись.ЕдиницаИзмерения);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецФУнкции
